package HomeworkTower;

public class Tower {

    // Рекурсивный:
    // 1. Переместить n-1 диска с начального стержня на конечный стержень.
    // 2. Переместить оставшегося диска с начального стержня на средний стержень.
    // 3. Переместить n-1 диска с вспомогательного стержня на конечный стержень.


    // Интерактивный:

    // Если количество дисков чётное, переместить диск на конечный стержень, следущую на средний. И так пока стек не будет пуст.

    for i = 1; i <= moves;
    if i%3 == 1; // переместить верхний
    if i%3 == 2;
    if i%3 == 0;




}
